{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Acne",
    "1": "Arthritis",
    "2": "Bronchial Asthma",
    "3": "Cervical spondylosis",
    "4": "Chicken pox",
    "5": "Common Cold",
    "6": "Dengue",
    "7": "Dimorphic Hemorrhoids",
    "8": "Fungal infection",
    "9": "Hypertension",
    "10": "Impetigo",
    "11": "Jaundice",
    "12": "Malaria",
    "13": "Migraine",
    "14": "Pneumonia",
    "15": "Psoriasis",
    "16": "Typhoid",
    "17": "Varicose Veins",
    "18": "allergy",
    "19": "diabetes",
    "20": "drug reaction",
    "21": "gastroesophageal reflux disease",
    "22": "peptic ulcer disease",
    "23": "urinary tract infection"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Acne": 0,
    "Arthritis": 1,
    "Bronchial Asthma": 2,
    "Cervical spondylosis": 3,
    "Chicken pox": 4,
    "Common Cold": 5,
    "Dengue": 6,
    "Dimorphic Hemorrhoids": 7,
    "Fungal infection": 8,
    "Hypertension": 9,
    "Impetigo": 10,
    "Jaundice": 11,
    "Malaria": 12,
    "Migraine": 13,
    "Pneumonia": 14,
    "Psoriasis": 15,
    "Typhoid": 16,
    "Varicose Veins": 17,
    "allergy": 18,
    "diabetes": 19,
    "drug reaction": 20,
    "gastroesophageal reflux disease": 21,
    "peptic ulcer disease": 22,
    "urinary tract infection": 23
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "use_cache": false,
  "vocab_size": 30522
}
